tutorials/rigidBodyAndBeam/rigidBodyAndBeam/0/beam/Omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      Omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
60
(
(2.93797e-15 -2.13839e-05 1.21302e-19)
(2.93797e-15 -2.03526e-05 1.11254e-19)
(2.93797e-15 -1.97543e-05 1.12582e-19)
(2.93797e-15 -1.9007e-05 1.05344e-19)
(2.93797e-15 -1.8283e-05 1.03923e-19)
(2.93797e-15 -1.75844e-05 9.81262e-20)
(2.93798e-15 -1.68471e-05 9.4888e-20)
(2.93798e-15 -1.61471e-05 9.16271e-20)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (2.93797e-15 -2.13839e-05 1.21302e-19);
    }
    right
    {
        type            calculated;
        value           uniform (2.93797e-15 2.1384e-05 -1.20059e-19);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
