tutorials/rigidBodyAndBeam/rigidBodyAndBeam/0/beam/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/beam";
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            momentBeamRotationNR;
        value           uniform (0 0 0);
        momentSeries
        {
            file            "$FOAM_CASE/constant/beam/timeVsMoment";
            outOfBounds     clamp;
        }
        moment          uniform (0 0 0);
    }
    right
    {
        type            momentBeamRotationNR;
        value           uniform (0 0 0);
        momentSeries
        {
            file            "$FOAM_CASE/constant/beam/timeVsMoment";
            outOfBounds     clamp;
        }
        moment          uniform (0 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
