tutorials/rigidBodyAndBeam/rigidBodyAndBeam/constant/beam/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       59;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       60;
    }
    beam
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1920;
        startFace       61;
    }
)

// ************************************************************************* //
